# Parameter Utils Methods

Source: https://www.revitapidocs.com/2026/ecb40b95-2e4f-d198-e11e-f7b6b8b1febc.htm

---

| Parameter Utils Methods |
| --- |

The ParameterUtils type exposes the following members.

Methods

|  | Name | Description |
| --- | --- | --- |
|  | DownloadCompanyName | Downloads the name of the given parameter's owning account and records it in the given document. If the owning  account's name is already recorded in the given document, this method returns the name without downloading it  again. |
|  | DownloadParameter | Create a shared parameter element in the given document according to a parameter definition downloaded from the Parameters Service. |
|  | DownloadParameterOptions | Retrieves settings associated with the given parameter from the Parameters Service. |
|  | GetAllBuiltInGroups | Gets the identifiers of all built\-in parameter groups. |
|  | GetAllBuiltInParameters | Gets the identifiers of all built\-in parameters. |
|  | GetBuiltInParameter | Gets the BuiltInParameter value corresponding to built\-in parameter identified by the given ForgeTypeId. |
|  | GetBuiltInParameterGroupTypeId | The parameter group identifier corresponding to the given built\-in parameter identifier. |
|  | GetParameterTypeId | Gets the ForgeTypeId identifying the built\-in parameter corresponding to the given BuiltInParameter value. |
|  | IsBuiltInGroup | Checks whether a ForgeTypeId identifies a built\-in parameter group. |
|  | IsBuiltInParameter(ElementId) | Checks whether an ElementId identifies a built\-in parameter. |
|  | IsBuiltInParameter(ForgeTypeId) | Checks whether a ForgeTypeId identifies a built\-in parameter. |

Top See Also

#### Reference

ParameterUtils Class Autodesk.Revit.DB Namespace